hejhog/app/controllers/api/v1/main_paths_controller.rb

  def create
    main_path = MainPath.create(main_path_params)
---
INSERT INTO "main_paths" ("main_branch", "base_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["main_branch", "generation"], ["base_url_id", 9], ["created_at", "2017-06-01 15:30:18.148769"], ["updated_at", "2017-06-01 15:30:18.148769"]]